results/wrk2/graalvmce1/jsonpost.txt
andriy@notebook:~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t4 -R55000 -L -v -s src/test/lua/jsonPost.lua http://localhost:9000/json
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/json
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.336ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.328ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.340ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.340ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.49ms    1.65ms  43.10ms   95.84%
    Req/Sec    14.51k     1.41k   22.22k    79.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.19ms
 75.000%    1.70ms
 90.000%    2.32ms
 99.000%    8.33ms
 99.900%   21.89ms
 99.990%   35.01ms
 99.999%   39.84ms
100.000%   43.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.100     0.000000            1         1.00
       0.554     0.100000       275017         1.11
       0.726     0.200000       550073         1.25
       0.877     0.300000       825833         1.43
       1.028     0.400000      1100246         1.67
       1.188     0.500000      1374419         2.00
       1.272     0.550000      1510865         2.22
       1.362     0.600000      1649099         2.50
       1.459     0.650000      1786138         2.86
       1.568     0.700000      1923160         3.33
       1.696     0.750000      2060895         4.00
       1.769     0.775000      2129453         4.44
       1.850     0.800000      2197528         5.00
       1.942     0.825000      2266476         5.71
       2.045     0.850000      2334829         6.67
       2.167     0.875000      2404004         8.00
       2.237     0.887500      2438321         8.89
       2.315     0.900000      2472306        10.00
       2.409     0.912500      2506968        11.43
       2.523     0.925000      2540948        13.33
       2.675     0.937500      2575196        16.00
       2.773     0.943750      2592147        17.78
       2.897     0.950000      2609330        20.00
       3.065     0.956250      2626500        22.86
       3.321     0.962500      2643665        26.67
       3.777     0.968750      2660820        32.00
       4.135     0.971875      2669451        35.56
       4.583     0.975000      2677981        40.00
       5.139     0.978125      2686553        45.71
       5.783     0.981250      2695139        53.33
       6.523     0.984375      2703716        64.00
       6.927     0.985938      2708004        71.11
       7.383     0.987500      2712285        80.00
       7.931     0.989062      2716584        91.43
       8.607     0.990625      2720883       106.67
       9.423     0.992188      2725169       128.00
       9.895     0.992969      2727315       142.22
      10.439     0.993750      2729444       160.00
      11.079     0.994531      2731599       182.86
      11.943     0.995313      2733731       213.33
      13.079     0.996094      2735887       256.00
      13.703     0.996484      2736944       284.44
      14.431     0.996875      2738019       320.00
      15.255     0.997266      2739096       365.71
      16.199     0.997656      2740164       426.67
      17.375     0.998047      2741238       512.00
      18.063     0.998242      2741771       568.89
      18.879     0.998437      2742320       640.00
      19.839     0.998633      2742853       731.43
      20.863     0.998828      2743388       853.33
      22.047     0.999023      2743919      1024.00
      23.007     0.999121      2744187      1137.78
      24.159     0.999219      2744458      1280.00
      25.471     0.999316      2744724      1462.86
      27.071     0.999414      2744991      1706.67
      28.879     0.999512      2745259      2048.00
      29.695     0.999561      2745393      2275.56
      30.511     0.999609      2745530      2560.00
      31.279     0.999658      2745663      2925.71
      32.079     0.999707      2745797      3413.33
      32.703     0.999756      2745934      4096.00
      32.991     0.999780      2745996      4551.11
      33.311     0.999805      2746065      5120.00
      33.663     0.999829      2746133      5851.43
      34.015     0.999854      2746197      6826.67
      34.559     0.999878      2746269      8192.00
      34.751     0.999890      2746298      9102.22
      35.039     0.999902      2746333     10240.00
      35.519     0.999915      2746368     11702.86
      35.871     0.999927      2746404     13653.33
      36.223     0.999939      2746433     16384.00
      36.447     0.999945      2746450     18204.44
      36.767     0.999951      2746465     20480.00
      37.215     0.999957      2746483     23405.71
      37.471     0.999963      2746499     27306.67
      37.951     0.999969      2746516     32768.00
      38.143     0.999973      2746524     36408.89
      38.367     0.999976      2746532     40960.00
      38.559     0.999979      2746541     46811.43
      38.943     0.999982      2746550     54613.33
      39.295     0.999985      2746558     65536.00
      39.487     0.999986      2746564     72817.78
      39.583     0.999988      2746566     81920.00
      39.775     0.999989      2746570     93622.86
      39.871     0.999991      2746574    109226.67
      40.255     0.999992      2746580    131072.00
      40.287     0.999993      2746581    145635.56
      40.543     0.999994      2746583    163840.00
      40.703     0.999995      2746585    187245.71
      40.927     0.999995      2746587    218453.33
      41.023     0.999996      2746589    262144.00
      41.055     0.999997      2746590    291271.11
      41.183     0.999997      2746591    327680.00
      41.215     0.999997      2746592    374491.43
      41.375     0.999998      2746594    436906.67
      41.375     0.999998      2746594    524288.00
      41.791     0.999998      2746595    582542.22
      41.791     0.999998      2746595    655360.00
      42.239     0.999999      2746596    748982.86
      42.239     0.999999      2746596    873813.33
      42.719     0.999999      2746597   1048576.00
      42.719     0.999999      2746597   1165084.44
      42.719     0.999999      2746597   1310720.00
      42.847     0.999999      2746598   1497965.71
      42.847     0.999999      2746598   1747626.67
      42.847     1.000000      2746598   2097152.00
      42.847     1.000000      2746598   2330168.89
      42.847     1.000000      2746598   2621440.00
      43.135     1.000000      2746599   2995931.43
      43.135     1.000000      2746599          inf
#[Mean    =        1.487, StdDeviation   =        1.653]
#[Max     =       43.104, Total count    =      2746599]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3298345 requests in 1.00m, 1.21GB read
Requests/sec:  54974.07
Transfer/sec:     20.60MB