results/wrk2/graalvmce1/plaintextget.txt
andriy@notebook:~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t4 -R100000 -L -v http://localhost:9000/plaintext
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/plaintext
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.223ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.251ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.268ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.239ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.23ms    0.97ms  26.54ms   85.74%
    Req/Sec    26.40k     2.47k   50.33k    74.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.07ms
 75.000%    1.60ms
 90.000%    2.18ms
 99.000%    3.95ms
 99.900%   12.06ms
 99.990%   16.67ms
 99.999%   24.16ms
100.000%   26.56ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.036     0.000000            1         1.00
       0.371     0.100000       500457         1.11
       0.557     0.200000      1001148         1.25
       0.731     0.300000      1500326         1.43
       0.901     0.400000      2000281         1.67
       1.070     0.500000      2497692         2.00
       1.158     0.550000      2747088         2.22
       1.251     0.600000      2996384         2.50
       1.353     0.650000      3247726         2.86
       1.466     0.700000      3497076         3.33
       1.595     0.750000      3746471         4.00
       1.667     0.775000      3871515         4.44
       1.745     0.800000      3995585         5.00
       1.832     0.825000      4120451         5.71
       1.930     0.850000      4245210         6.67
       2.043     0.875000      4369699         8.00
       2.109     0.887500      4433365         8.89
       2.179     0.900000      4494491        10.00
       2.259     0.912500      4556917        11.43
       2.351     0.925000      4619306        13.33
       2.459     0.937500      4682456        16.00
       2.519     0.943750      4713048        17.78
       2.587     0.950000      4744167        20.00
       2.665     0.956250      4775594        22.86
       2.755     0.962500      4806860        26.67
       2.863     0.968750      4837754        32.00
       2.929     0.971875      4853648        35.56
       3.001     0.975000      4868915        40.00
       3.091     0.978125      4884612        45.71
       3.203     0.981250      4900204        53.33
       3.353     0.984375      4915821        64.00
       3.455     0.985938      4923612        71.11
       3.589     0.987500      4931348        80.00
       3.783     0.989062      4939151        91.43
       4.087     0.990625      4946957       106.67
       4.595     0.992188      4954751       128.00
       4.979     0.992969      4958655       142.22
       5.459     0.993750      4962534       160.00
       6.043     0.994531      4966445       182.86
       6.679     0.995313      4970352       213.33
       7.439     0.996094      4974256       256.00
       7.871     0.996484      4976194       284.44
       8.327     0.996875      4978151       320.00
       8.823     0.997266      4980099       365.71
       9.375     0.997656      4982043       426.67
       9.975     0.998047      4983996       512.00
      10.319     0.998242      4984967       568.89
      10.719     0.998437      4985952       640.00
      11.135     0.998633      4986940       731.43
      11.591     0.998828      4987912       853.33
      12.119     0.999023      4988870      1024.00
      12.367     0.999121      4989370      1137.78
      12.623     0.999219      4989847      1280.00
      12.919     0.999316      4990341      1462.86
      13.231     0.999414      4990822      1706.67
      13.583     0.999512      4991312      2048.00
      13.807     0.999561      4991553      2275.56
      14.039     0.999609      4991794      2560.00
      14.335     0.999658      4992048      2925.71
      14.655     0.999707      4992282      3413.33
      15.039     0.999756      4992532      4096.00
      15.279     0.999780      4992650      4551.11
      15.487     0.999805      4992773      5120.00
      15.727     0.999829      4992896      5851.43
      15.983     0.999854      4993018      6826.67
      16.271     0.999878      4993136      8192.00
      16.479     0.999890      4993198      9102.22
      16.719     0.999902      4993258     10240.00
      16.959     0.999915      4993319     11702.86
      17.407     0.999927      4993381     13653.33
      17.983     0.999939      4993441     16384.00
      18.239     0.999945      4993471     18204.44
      18.671     0.999951      4993502     20480.00
      19.343     0.999957      4993531     23405.71
      20.447     0.999963      4993562     27306.67
      21.247     0.999969      4993592     32768.00
      21.583     0.999973      4993607     36408.89
      22.271     0.999976      4993623     40960.00
      22.639     0.999979      4993639     46811.43
      22.959     0.999982      4993653     54613.33
      23.423     0.999985      4993668     65536.00
      23.551     0.999986      4993676     72817.78
      23.871     0.999988      4993684     81920.00
      24.031     0.999989      4993691     93622.86
      24.287     0.999991      4993700    109226.67
      24.607     0.999992      4993706    131072.00
      24.767     0.999993      4993710    145635.56
      24.911     0.999994      4993714    163840.00
      25.183     0.999995      4993718    187245.71
      25.375     0.999995      4993722    218453.33
      25.471     0.999996      4993725    262144.00
      25.599     0.999997      4993728    291271.11
      25.695     0.999997      4993729    327680.00
      25.743     0.999997      4993731    374491.43
      25.839     0.999998      4993733    436906.67
      25.967     0.999998      4993735    524288.00
      26.031     0.999998      4993736    582542.22
      26.047     0.999998      4993737    655360.00
      26.063     0.999999      4993738    748982.86
      26.095     0.999999      4993739    873813.33
      26.207     0.999999      4993740   1048576.00
      26.207     0.999999      4993740   1165084.44
      26.303     0.999999      4993742   1310720.00
      26.303     0.999999      4993742   1497965.71
      26.303     0.999999      4993742   1747626.67
      26.303     1.000000      4993742   2097152.00
      26.303     1.000000      4993742   2330168.89
      26.351     1.000000      4993743   2621440.00
      26.351     1.000000      4993743   2995931.43
      26.351     1.000000      4993743   3495253.33
      26.351     1.000000      4993743   4194304.00
      26.351     1.000000      4993743   4660337.78
      26.559     1.000000      4993744   5242880.00
      26.559     1.000000      4993744          inf
#[Mean    =        1.232, StdDeviation   =        0.975]
#[Max     =       26.544, Total count    =      4993744]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5996855 requests in 1.00m, 2.17GB read
Requests/sec:  99951.16
Transfer/sec:     36.98MB